In [2]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'name': ['alice','bob','charlie','daniel'],
    'age': [2,15,30,70]
})
df

      name  age
0    alice    2
1      bob   15
2  charlie   30
3   daniel   70

In [3]:
df.assign(
    age_cat = lambda x : x.age.map(lambda x : 'Young' if x < 30 else 'Old')
)

      name  age age_cat
0    alice    2   Young
1      bob   15   Young
2  charlie   30     Old
3   daniel   70     Old

In [4]:
df = pd.DataFrame({
    'make': ['audi','audi','mercedes','toyota', 'honda'],
    'price': [200,200,3000,70000,5000]
})
df

       make  price
0      audi    200
1      audi    200
2  mercedes   3000
3    toyota  70000
4     honda   5000

In [5]:
german_list = ['audi', 'mercedes', 'bmw', ]
japan_list = ['toyota', 'honda', 'mazda']

conditions = [ 
    (df.make.isin(german_list)),
    (df.make.isin(japan_list)),
]

values = ['German', 'Japan']

df['make_country'] = np.select(conditions, values)
df

       make  price make_country
0      audi    200       German
1      audi    200       German
2  mercedes   3000       German
3    toyota  70000        Japan
4     honda   5000        Japan

In [6]:
German = ['audi', 'mercedes', 'bmw']
df.loc[df.make.isin(German),  'country'] = 'German'

In [7]:
df.loc[[0,3], 'price'] = 299
df

       make  price make_country country
0      audi    299       German  German
1      audi    200       German  German
2  mercedes   3000       German  German
3    toyota    299        Japan     NaN
4     honda   5000        Japan     NaN

In [8]:
df.loc[0, 'price']

299

In [9]:
df

       make  price make_country country
0      audi    299       German  German
1      audi    200       German  German
2  mercedes   3000       German  German
3    toyota    299        Japan     NaN
4     honda   5000        Japan     NaN

In [10]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [11]:
df.duplicated(keep= 'last')

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [12]:
df.duplicated(keep= 'first')

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [13]:
df.duplicated(keep= False)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [14]:
df.duplicated(subset=['make', 'country'], keep= False)

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [15]:
df

       make  price make_country country
0      audi    299       German  German
1      audi    200       German  German
2  mercedes   3000       German  German
3    toyota    299        Japan     NaN
4     honda   5000        Japan     NaN

In [16]:
print(df.shape)
df.drop_duplicates().shape

(5, 4)

(5, 4)

In [36]:
df = pd.read_csv('auto_02.csv')
df.drop('Unnamed: 0', axis=1, inplace=True)
df.head(2)

,location,make,model,make_model,age,short_description,year,price,mileage_km,registration,...,Safety & Security,extras,colour,manufacturer_color,paint,upholstery_colour,upholstery,power_kw,power_hp,make_country
0,LOON OP ZAND,Audi,A3,Audi-A3,19.0,2.0 FSI Ambition Pro Line,2003.0,4450.0,191066.0,2003-08-01,...,"'ABS', 'Alarm system', 'Central door lock', 'C...",'Alloy wheels',Grey,None,Metallic,Black,Cloth,110.0,150.0,German
1,HEERLEN,Audi,A3,Audi-A3,9.0,Sportback 1.4 TFSI Ambiente/ECC/PDC//Lichtmeta...,2013.0,12950.0,94758.0,2013-10-01,...,"'Alarm system', 'Central door lock', 'Central ...","'Alloy wheels (16"")'",White,None,None,Black,Cloth,92.0,125.0,German

In [37]:
df.loc[df.price.isnull(), :].count()

location                   1570
make                       1570
model                      1570
make_model                 1570
age                        1570
short_description          1567
year                       1570
price                         0
mileage_km                 1570
registration               1570
fuel_type                  1570
seller                     1570
body_type                  1570
type                       1570
drivetrain                 1570
seats                      1471
doors                      1567
country_version            1570
offer_number               1570
warranty_months             487
first_registration         1570
production_date             187
general_inspection          878
last_service               1570
full_service_history       1570
non_smoker_vehicle         1570
previous_owner             1570
last_timing_belt_change    1570
Gearbox                    1570
engine_size_cc             1477
gears                      1570
cylinders                  1459
empty_weight_kg            1549
Fuel_type                  1570
fuel_consumption           1446
co2_emissions_g_km_comb    1233
emission_class             1570
emissions_sticker          1570
Comfort & Convenience      1570
Entertainment & Media      1570
Safety & Security          1570
extras                     1570
colour                     1570
manufacturer_color         1570
paint                      1570
upholstery_colour          1570
upholstery                 1570
power_kw                   1496
power_hp                   1496
make_country               1570
dtype: int64

In [19]:
df.duplicated(keep= False).sum()

3995

In [20]:
df.duplicated(subset=['make_model', 'year', 'mileage_km','price', 'short_description' ]).sum()

3123

In [21]:
df.loc[df.duplicated(keep=False), :].head(6)

,location,make,model,make_model,age,short_description,year,price,mileage_km,registration,...,Safety & Security,extras,colour,manufacturer_color,paint,upholstery_colour,upholstery,power_kw,power_hp,make_country
415,ROTTERDAM,Audi,A3,Audi-A3,12.0,1.4 TFSI S-edition,2010.0,6749.0,220000.0,2010-03-01,...,"'Central door lock with remote control', 'Dayt...","'Alloy wheels', 'Roof rack', 'Spoiler', 'Sport...",Black,None,None,Black,Partleather,92.0,125.0,German
604,ZUILICHEM,Audi,A1,Audi-A1,10.0,1.2 TFSI Connect 2012 Airco Navigatie Cruise C...,2012.0,5950.0,291473.0,2012-01-01,...,"'ABS', 'Central door lock', 'Central door lock...","'Alloy wheels (16"")'",Black,None,None,None,None,63.0,86.0,German
607,GORINCHEM,Audi,A1,Audi-A1,12.0,1.2 TFSI Attraction Airco,2010.0,5950.0,221136.0,2010-12-01,...,"'ABS', 'Alarm system', 'Central door lock', 'C...",'Alloy wheels',White,None,None,None,Cloth,63.0,86.0,German
625,OOSTDIJK,Audi,A3,Audi-A3,13.0,1.4 TFSI Attraction,2009.0,5700.0,200250.0,2009-04-01,...,"'ABS', 'Central door lock with remote control'...","'Alloy wheels (16"")', 'Spare tyre', 'Trailer h...",Blue,None,Metallic,Blue,Cloth,92.0,125.0,German
635,WOMMELS,Audi,A3,Audi-A3,16.0,1.6 FSI Ambiente,2006.0,2750.0,289500.0,2006-11-01,...,"'Central door lock', 'Central door lock with r...","'Alloy wheels (16"")', 'Automatically dimming i...",Blue,None,None,None,None,85.0,116.0,German
638,WOMMELS,Audi,A3,Audi-A3,16.0,1.6 FSI Ambiente,2006.0,2750.0,289500.0,2006-11-01,...,"'Central door lock', 'Central door lock with r...","'Alloy wheels (16"")', 'Automatically dimming i...",Blue,None,None,None,None,85.0,116.0,German

In [22]:
df.duplicated().sum()

2012

In [23]:
df.duplicated(keep ='last').sum()

2012

In [45]:
df = pd.DataFrame({
    'make': ['audi','audi','audi','mercedes',np.NaN, 'honda'],
    'price': [np.NaN,200,200,3000,70000,np.NaN]
})
df

       make    price
0      audi      NaN
1      audi    200.0
2      audi    200.0
3  mercedes   3000.0
4       NaN  70000.0
5     honda      NaN

In [46]:
df.loc[df.duplicated() , :]

   make  price
2  audi  200.0

In [51]:
df.isnull().sum()

make     1
price    2
dtype: int64

In [59]:
df.dropna(subset=['price'], inplace=False)

       make    price
1      audi    200.0
2      audi    200.0
3  mercedes   3000.0
4       NaN  70000.0

In [8]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman', np.NAN],

                   "toy": [np.nan, 'Batmobile', 'Bullwhip', 'Lego'],

                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),

                            pd.NaT, pd.Timestamp("2020-04-25")]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3       NaN       Lego 2020-04-25

In [12]:
df.dropna(subset=['name', 'toy'], how='any')

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [16]:
df = pd.read_csv('df_mer_bmw.csv')
df.drop('Unnamed: 0', axis=1, inplace= True)
df.head(1)

,location,make,model,make_model,age,short_description,year,price,mileage_km,registration,...,Safety & Security,extras,colour,manufacturer_color,paint,upholstery_colour,upholstery,power_kw,power_hp,make_country
0,APLHEN AAN DEN RIJN,BMW,316,BMW-316,21.0,Compact 316ti Executive,2001.0,1450.0,231339.0,2001-09-01,...,"'ABS', 'Alarm system', 'Central door lock', 'C...",'Sport suspension',Blue,None,Metallic,None,Cloth,85.0,116.0,German

In [90]:
small_30_tf = (df.make_model.value_counts() < 30)
(small_30_tf).index.values

(294,)

In [71]:
(df.make_model.value_counts(ascending= True) < 30)

MercedesBenz-S300      True
BMW-M850               True
BMW-620                True
BMW-425                True
MercedesBenz-ML450     True
                      ...
BMW-330               False
BMW-218               False
MercedesBenz-C180     False
BMW-X5                False
BMW-320               False
Name: make_model, Length: 294, dtype: bool

In [72]:
(df.make_model.value_counts(ascending= True) < 30).index

Index(['MercedesBenz-S300', 'BMW-M850', 'BMW-620', 'BMW-425',
       'MercedesBenz-ML450', 'MercedesBenz-S550', 'BMW-ActiveHybridX6',
       'MercedesBenz-CLA35AMG', 'BMW-123', 'MercedesBenz-E430',
       ...
       'MercedesBenz-B180', 'BMW-318', 'BMW-118', 'BMW-X1',
       'MercedesBenz-A180', 'BMW-330', 'BMW-218', 'MercedesBenz-C180',
       'BMW-X5', 'BMW-320'],
      dtype='object', length=294)

In [185]:
[i for i in small_30_tf.index if small_30_tf[i]][:10]

['BMW-645',
 'BMW-430',
 'BMW-X4',
 'MercedesBenz-A220',
 'BMW-135',
 'MercedesBenz-S320',
 'MercedesBenz-C63AMG',
 'MercedesBenz-S500',
 'BMW-440',
 'MercedesBenz-E280']

In [96]:
small_30_tf[small_30_tf].index.shape

(203,)

In [84]:
s = pd.Series([True, False, True, True, False, False, False, True])
s

0     True
1    False
2     True
3     True
4    False
5    False
6    False
7     True
dtype: bool

In [85]:
s.index

RangeIndex(start=0, stop=8, step=1)

In [86]:
s.index.values

array([0, 1, 2, 3, 4, 5, 6, 7])

In [87]:
s[s].index

Int64Index([0, 2, 3, 7], dtype='int64')

In [89]:
s[s].index.values

2

In [152]:
aranan = small_30_tf[small_30_tf].index
aranan

Index(['BMW-645', 'BMW-430', 'BMW-X4', 'MercedesBenz-A220', 'BMW-135',
       'MercedesBenz-S320', 'MercedesBenz-C63AMG', 'MercedesBenz-S500',
       'BMW-440', 'MercedesBenz-E280',
       ...
       'BMW-X3M', 'MercedesBenz-GLK300', 'MercedesBenz-GL63AMG',
       'MercedesBenz-GLA35AMG', 'MercedesBenz-E430', 'MercedesBenz-CLS63AMG',
       'MercedesBenz-S550', 'MercedesBenz-CLA35AMG', 'MercedesBenz-416',
       'MercedesBenz-S300'],
      dtype='object', length=203)

In [168]:
list_aranan = list(aranan)
len(list_aranan)

203

In [101]:
df.head(1)

,location,make,model,make_model,age,short_description,year,price,mileage_km,registration,...,Safety & Security,extras,colour,manufacturer_color,paint,upholstery_colour,upholstery,power_kw,power_hp,make_country
0,APLHEN AAN DEN RIJN,BMW,316,BMW-316,21.0,Compact 316ti Executive,2001.0,1450.0,231339.0,2001-09-01,...,"'ABS', 'Alarm system', 'Central door lock', 'C...",'Sport suspension',Blue,None,Metallic,None,Cloth,85.0,116.0,German

In [133]:
df.loc[(df.price > 300000), ['make_model' , 'price'] ]

               make_model      price
10415  MercedesBenz-AMGGT  1250000.0
11276   MercedesBenz-G400   999999.0

In [141]:
(df.price > 300000)[(df.price > 300000)]

Int64Index([10415, 11276], dtype='int64')

In [169]:

criteria = df['make_model'].map(lambda x :  x in list_aranan)

In [175]:
df[criteria].groupby('make_model')['model'].count()

make_model
BMW-114               17
BMW-123                1
BMW-125               23
BMW-130                6
BMW-135               27
                      ..
MercedesBenz-V250     18
MercedesBenz-V300      9
MercedesBenz-Viano    16
MercedesBenz-X250     10
MercedesBenz-X350      4
Name: model, Length: 203, dtype: int64

In [177]:
df[criteria].index

Int64Index([    5,     6,    16,   115,   147,   185,   191,   193,   202,
              204,
            ...
            13718, 13720, 13770, 13775, 13788, 13797, 13923, 13936, 13945,
            13952],
           dtype='int64', length=1561)

In [178]:
df.index

RangeIndex(start=0, stop=13956, step=1)

In [179]:
small_30_tf = (df.make_model.value_counts() < 30)

aranan = small_30_tf[small_30_tf].index

list_aranan = list(aranan)

criteria = df['make_model'].map(lambda x :  x in list_aranan)

df[criteria].index

Int64Index([    5,     6,    16,   115,   147,   185,   191,   193,   202,
              204,
            ...
            13718, 13720, 13770, 13775, 13788, 13797, 13923, 13936, 13945,
            13952],
           dtype='int64', length=1561)

In [180]:
df.shape

(13956, 50)

In [181]:
df.drop(index= df[criteria].index ).shape

(12395, 50)

In [182]:
small_30_tf

BMW-320                  False
BMW-X5                   False
MercedesBenz-C180        False
BMW-218                  False
BMW-330                  False
                         ...
MercedesBenz-CLS63AMG     True
MercedesBenz-S550         True
MercedesBenz-CLA35AMG     True
MercedesBenz-416          True
MercedesBenz-S300         True
Name: make_model, Length: 294, dtype: bool

In [184]:
(df.make_model.value_counts() < 30)

BMW-320                  False
BMW-X5                   False
MercedesBenz-C180        False
BMW-218                  False
BMW-330                  False
                         ...
MercedesBenz-CLS63AMG     True
MercedesBenz-S550         True
MercedesBenz-CLA35AMG     True
MercedesBenz-416          True
MercedesBenz-S300         True
Name: make_model, Length: 294, dtype: bool

In [186]:
df = pd.DataFrame({
    'make': ['audi','audi','audi','mercedes',np.NaN, 'honda'],
    'price': [np.NaN,200,200,3000,70000,np.NaN]
})
df

       make    price
0      audi      NaN
1      audi    200.0
2      audi    200.0
3  mercedes   3000.0
4       NaN  70000.0
5     honda      NaN

In [188]:
make_to_country = {'audi' : 'german',
                   'mercedes' : 'german',
                   'honda' : 'japan'
}
df['country'] = df.make.map(make_to_country)
df

       make    price country
0      audi      NaN  german
1      audi    200.0  german
2      audi    200.0  german
3  mercedes   3000.0  german
4       NaN  70000.0     NaN
5     honda      NaN   japan

In [189]:
df = pd.DataFrame({
    'make': ['audi','audi','audi','mercedes',np.NaN, 'honda'],
    'price': [np.NaN,200,200,3000,70000,np.NaN]
})
df

       make    price
0      audi      NaN
1      audi    200.0
2      audi    200.0
3  mercedes   3000.0
4       NaN  70000.0
5     honda      NaN

In [190]:
make_to_country = {['audi' , 'mercedes'] : 'german',
                   'honda' : 'japan'
}
df['country'] = df.make.map(make_to_country)
df

TypeError: unhashable type: 'list'

In [192]:
df = pd.DataFrame(np.array([[1, 1], [2, 10], [3, 100], [4, 100]]),

                  columns=['a', 'b'])

df

   a    b
0  1    1
1  2   10
2  3  100
3  4  100

In [195]:
df.quantile(0.99)

a      3.97
b    100.00
Name: 0.99, dtype: float64

In [197]:
s = pd.Series(list('abca'))
s

0    a
1    b
2    c
3    a
dtype: object

In [198]:
df.head()

   a    b
0  1    1
1  2   10
2  3  100
3  4  100

In [200]:
df.b.loc[df.b >50]

2    100
3    100
Name: b, dtype: int64

In [201]:
df.b.loc[df.b >50] = 9999
df.b.loc[df.b >50]

2    9999
3    9999
Name: b, dtype: int64

In [202]:
df

   a     b
0  1     1
1  2    10
2  3  9999
3  4  9999

In [2]:
from sklearn.compose import make_column_transformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.linear_model import LinearRegression
from sklearn.pipeline import make_pipeline
from sklearn.model_selection import cross_val_score

In [13]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
np.array([ 22116.15639432,  20575.34491639,  14825.92010352,  18720.31927493,
        20046.44711295,  23837.85638874,  16337.23308209,   5473.44882059])

array([22116.15639432, 20575.34491639, 14825.92010352, 18720.31927493,
       20046.44711295, 23837.85638874, 16337.23308209,  5473.44882059])

In [18]:
df08 = df.head(8)
df08

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [21]:
df_pre = pd.DataFrame({'Predict' : np.array([ 22116.15639432,  20575.34491639,  14825.92010352,  18720.31927493,
        20046.44711295,  23837.85638874,  16337.23308209,   5473.44882059])})

df_pre

        Predict
0  22116.156394
1  20575.344916
2  14825.920104
3  18720.319275
4  20046.447113
5  23837.856389
6  16337.233082
7   5473.448821

In [23]:
df_new = pd.concat([df08, df_pre], axis=1 , ignore_index=False)
df_new

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Predict
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22116.156394
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,20575.344916
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,14825.920104
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,18720.319275
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,20046.447113
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,23837.856389
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,16337.233082
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,5473.448821

# LOAD DATASET

In [91]:
pd.set_option('display.float_format', lambda x: '%.0f' % x)
df = pd.read_csv('df_full.csv', index_col=[0])
df = df[['make', 'model', 'year', 'mileage_km','price', 'Gearbox', 'fuel_type', 'colour', 'seller']]
print(df.head(2))

df.Gearbox = df.Gearbox.replace('None', np.NaN)

dms = pd.get_dummies(df[['make', 'model', 'Gearbox','fuel_type', 'colour','seller']], prefix='model')

X_ = df.drop(['price','make', 'model', 'Gearbox','fuel_type', 'colour','seller'], axis='columns').astype('float64')
y = df.price
X = pd.concat([X_, dms[list(dms.columns)]], axis=1)

pd.set_option('display.float_format', lambda x: '%.0f' % x)
X.head(2)

  make model  year  mileage_km  price    Gearbox fuel_type colour  seller
0  BMW   316  2001      231339   1450  Automatic  Gasoline   Blue  Dealer
1  BMW   320  2016      105267  22490  Automatic  Gasoline  Black  Dealer

,year,mileage_km,model_BMW,model_MercedesBenz,model_116,model_118,model_120,model_216,model_218,model_220,...,model_Grey,model_None,model_Orange,model_Red,model_Silver,model_Violet,model_White,model_Yellow,model_Dealer,model_Privateseller
0,2001,231339,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
1,2016,105267,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0

In [92]:
df.isna().sum()

make           0
model          0
year           0
mileage_km     0
price          0
Gearbox       15
fuel_type      0
colour         0
seller         0
dtype: int64

# ML MODEL

In [14]:
from sklearn.compose import make_column_transformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.pipeline import make_pipeline
from sklearn.model_selection import cross_val_score

from sklearn.model_selection import train_test_split, GridSearchCV,cross_val_score
from sklearn.metrics import mean_squared_error, r2_score
from sklearn.preprocessing import scale 
from sklearn import model_selection
from sklearn.neighbors import KNeighborsRegressor

In [19]:
from sklearn.ensemble import GradientBoostingRegressor

X_train, X_test, y_train, y_test = train_test_split(X, y, 
                                                    test_size=0.25, 
                                                    random_state=42)

gbm_model =  GradientBoostingRegressor()
gbm_model.fit(X_train, y_train)

y_pred = gbm_model.predict(X_test)
print('GBM_Model hata : ', np.sqrt(mean_squared_error(y_test, y_pred)))

gbm_params = {
            'learning_rate' :[0.01, 0.1],
            'max_depth': [50,100],
            'n_estimators': [100],
            'subsample': [1, 0.5],}

#gbm = GradientBoostingRegressor()
#gbm_cv_model =  GridSearchCV(gbm, gbm_params, cv=5, n_jobs=-1, verbose=2)
#gbm_cv_model.fit(X_train, y_train)

#gbm_cv_model.best_params_

gbm_tuned = GradientBoostingRegressor()

gbm_tuned = GradientBoostingRegressor ( learning_rate= 0.1,
                                       max_depth= 100,
                                       n_estimators= 100,
                                       subsample= 0.5)

gbm_tuned = gbm_tuned.fit(X_train, y_train)

y_pred =  gbm_tuned.predict(X_test)
%time print('GBM_Tuned Hata :', np.sqrt(mean_squared_error(y_test, y_pred)))

GBM_Model hata :  6243.31649227032
GBM_Tuned Hata : 5035.3038258909555
CPU times: user 494 µs, sys: 78 µs, total: 572 µs
Wall time: 587 µs

In [42]:
from sklearn.impute import SimpleImputer
df.head()

  make model  year  mileage_km  price    Gearbox fuel_type colour  seller
0  BMW   316  2001      231339   1450  Automatic  Gasoline   Blue  Dealer
1  BMW   320  2016      105267  22490  Automatic  Gasoline  Black  Dealer
2  BMW   116  2014       70491  15999  Automatic  Gasoline   Grey  Dealer
3  BMW   120  2004      342421   2790  Automatic  Gasoline   Blue  Dealer
4  BMW   435  2015       63507  35300  Automatic  Gasoline  Black  Dealer

In [94]:
imp = SimpleImputer(strategy='most_frequent')
df.iloc[:, :] = imp.fit_transform(df)
df.Gearbox.value_counts()

In [97]:
imp = SimpleImputer(missing_values='None', strategy='most_frequent')
df.iloc[:, :] = imp.fit_transform(df)
df.colour.value_counts()

Grey      4291
Black     3953
White     1511
Blue      1362
Silver     358
Brown      267
Red        178
Green       83
Beige       51
Orange      27
Yellow      26
Gold        12
Violet      12
Bronze       2
Name: colour, dtype: int64

Automatic        8975
Manual           3050
Semiautomatic     108
Name: Gearbox, dtype: int64

In [83]:
df.colour.value_counts()

Grey      4177
Black     3953
White     1511
Blue      1362
Silver     358
Brown      267
Red        178
None       114
Green       83
Beige       51
Orange      27
Yellow      26
Gold        12
Violet      12
Bronze       2
Name: colour, dtype: int64

In [90]:
imp = SimpleImputer( missing_values='None', strategy='constant', fill_value='AAA')
df.iloc[:, :] = imp.fit_transform(df)
df.colour.value_counts()

ValueError: Input contains NaN